{
  "about": {
    "title": "About Me",
    "journey": {
      "title": "My Journey",
      "description": "Java Developer focused on backend development, specialized in Spring Boot 3.5 and RESTful API architecture. Has over 2,000 hours of hands-on experience building production-oriented projects using Java 21, PostgreSQL, and enterprise development practices. /n/nHolds a Bachelor’s degree in Computer Science, with academic and practical training in software engineering, data structures, and full-stack fundamentals, with a strong emphasis on backend development. Works with a consistent focus on best practices such as clean code organization, separation of concerns, version control, testing, and API security. /n/nBrings a background in international scientific research, which shapes an analytical, methodical, and systematic approach to problem-solving. This experience directly influences how software solutions are designed: clear problem definition, well-structured implementation, and continuous validation. /n/nCurrently develops and maintains personal projects focused on REST APIs, authentication, data modeling, system integration, and architectural best practices, using the portfolio as a space for technical consolidation and continuous learning."
    },
    "education": {
      "title": "Education",
      "computerScience": {
        "title": "Computer Science",
        "description": "Graduated in Jan/2026"
      },
      "agronomy": {
        "title": "Scientific Research",
        "description": "PhD with international experience in data analysis and statistical modeling"
      }
    },
    "skills": {
      "title": "Technical Skills",
      "frontend": {
        "title": "Full-Stack",
        "description": "React, TypeScript, Node.js, React Native, Tailwind CSS"
      },
      "backend": {
        "title": "Backend Java",
        "description": "Java 21, Spring Boot 3.5, Spring Data JPA, Spring Security, Hibernate, Maven"
      },
      "tools": {
        "title": "Databases & DevOps",
        "description": "PostgreSQL, MySQL, REST APIs, JWT, Docker, Git, Maven"
      }
    },
    "downloadResume": "Download Resume"
  }
}
